1) /home/evalverde/projects/Price/Src/Domain/Number.php:24    [M] CastString

--- Original
+++ New
@@ @@
     private function __construct(string $integerPart, string $fractionalPart = '')
     {
         $this->preconditionNotNullArguments($integerPart, $fractionalPart);
-        $this->integerPart = $this->parseIntegerPart((string) $integerPart);
+        $this->integerPart = $this->parseIntegerPart($integerPart);
         $this->fractionalPart = $this->parseFractionalPart((string) $fractionalPart);
     }
     public static function fromString($number) : self

2) /home/evalverde/projects/Price/Src/Domain/Number.php:25    [M] CastString

--- Original
+++ New
@@ @@
     {
         $this->preconditionNotNullArguments($integerPart, $fractionalPart);
         $this->integerPart = $this->parseIntegerPart((string) $integerPart);
-        $this->fractionalPart = $this->parseFractionalPart((string) $fractionalPart);
+        $this->fractionalPart = $this->parseFractionalPart($fractionalPart);
     }
     public static function fromString($number) : self
     {

3) /home/evalverde/projects/Price/Src/Domain/Number.php:119    [M] NotIdentical

--- Original
+++ New
@@ @@
     }
     public function toFloat() : float
     {
-        return (float) (self::EMPTY_STRING !== $this->fractionalPart) ? $this->integerPart . $this->fractionalPart : $this->integerPart;
+        return (float) (self::EMPTY_STRING === $this->fractionalPart) ? $this->integerPart . $this->fractionalPart : $this->integerPart;
     }
     public function isNegative() : bool
     {

4) /home/evalverde/projects/Price/Src/Domain/Number.php:119    [M] CastFloat

--- Original
+++ New
@@ @@
     }
     public function toFloat() : float
     {
-        return (float) (self::EMPTY_STRING !== $this->fractionalPart) ? $this->integerPart . $this->fractionalPart : $this->integerPart;
+        return self::EMPTY_STRING !== $this->fractionalPart ? $this->integerPart . $this->fractionalPart : $this->integerPart;
     }
     public function isNegative() : bool
     {

5) /home/evalverde/projects/Price/Src/Domain/Number.php:129    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return self::NEGATIVE_SIGN === $this->integerPart[0];
     }
-    public function getIntegerPart() : string
+    protected function getIntegerPart() : string
     {
         return $this->integerPart;
     }

6) /home/evalverde/projects/Price/Src/Domain/Number.php:134    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->integerPart;
     }
-    public function getFractionalPart() : string
+    protected function getFractionalPart() : string
     {
         return $this->fractionalPart;
     }

7) /home/evalverde/projects/Price/Src/Domain/Number.php:146    [M] FalseValue

--- Original
+++ New
@@ @@
         if (null !== $default) {
             return $default;
         }
-        $nonZero = false;
+        $nonZero = true;
         $characters = strlen($number);
         for ($position = 0; $position < $characters; ++$position) {
             $digit = $number[$position];

8) /home/evalverde/projects/Price/Src/Domain/Number.php:151    [M] LogicalAnd

--- Original
+++ New
@@ @@
         $characters = strlen($number);
         for ($position = 0; $position < $characters; ++$position) {
             $digit = $number[$position];
-            if (!isset($this->numbers[$digit]) && !(0 === $position && self::NEGATIVE_SIGN === $digit)) {
+            if (!isset($this->numbers[$digit]) && !(0 === $position || self::NEGATIVE_SIGN === $digit)) {
                 throw new \InvalidArgumentException(sprintf('Invalid integer part %1$s. Invalid digit %2$s found', $number, $digit));
             }
             if (false === $nonZero && '0' === $digit) {

9) /home/evalverde/projects/Price/Src/Domain/Number.php:188    [M] DecrementInteger

--- Original
+++ New
@@ @@
         if (self::EMPTY_STRING === $number) {
             return $number;
         }
-        for ($position = 0, $characters = strlen($number); $position < $characters; ++$position) {
+        for ($position = -1, $characters = strlen($number); $position < $characters; ++$position) {
             $digit = $number[$position];
             if (!isset($this->numbers[$digit])) {
                 throw new \InvalidArgumentException(sprintf('Invalid fractional part %1$s. Invalid digit %2$s found', $number, $digit));

10) /home/evalverde/projects/Price/Src/Domain/Number.php:188    [M] OneZeroInteger

--- Original
+++ New
@@ @@
         if (self::EMPTY_STRING === $number) {
             return $number;
         }
-        for ($position = 0, $characters = strlen($number); $position < $characters; ++$position) {
+        for ($position = 1, $characters = strlen($number); $position < $characters; ++$position) {
             $digit = $number[$position];
             if (!isset($this->numbers[$digit])) {
                 throw new \InvalidArgumentException(sprintf('Invalid fractional part %1$s. Invalid digit %2$s found', $number, $digit));

Timed Out mutants:
==================

Not Covered mutants:
====================

1) /home/evalverde/projects/Price/Src/Domain/ConfigRepository.php:31    [M] PublicVisibility

--- Original
+++ New
@@ @@
      *
      * @return bool
      */
-    public function has($key)
+    protected function has($key)
     {
         $keys = (array) $key;
         if (!$this->items || $keys === []) {

2) /home/evalverde/projects/Price/Src/Domain/ConfigRepository.php:33    [M] CastArray

--- Original
+++ New
@@ @@
      */
     public function has($key)
     {
-        $keys = (array) $key;
+        $keys = $key;
         if (!$this->items || $keys === []) {
             return false;
         }

3) /home/evalverde/projects/Price/Src/Domain/ConfigRepository.php:34    [M] LogicalNot

--- Original
+++ New
@@ @@
     public function has($key)
     {
         $keys = (array) $key;
-        if (!$this->items || $keys === []) {
+        if ($this->items || $keys === []) {
             return false;
         }
         foreach ($keys as $key) {

4) /home/evalverde/projects/Price/Src/Domain/ConfigRepository.php:34    [M] Identical

--- Original
+++ New
@@ @@
     public function has($key)
     {
         $keys = (array) $key;
-        if (!$this->items || $keys === []) {
+        if (!$this->items || $keys !== []) {
             return false;
         }
         foreach ($keys as $key) {

5) /home/evalverde/projects/Price/Src/Domain/ConfigRepository.php:34    [M] LogicalOr

--- Original
+++ New
@@ @@
     public function has($key)
     {
         $keys = (array) $key;
-        if (!$this->items || $keys === []) {
+        if (!$this->items && $keys === []) {
             return false;
         }
         foreach ($keys as $key) {

6) /home/evalverde/projects/Price/Src/Domain/ConfigRepository.php:35    [M] FalseValue

--- Original
+++ New
@@ @@
     {
         $keys = (array) $key;
         if (!$this->items || $keys === []) {
-            return false;
+            return true;
         }
         foreach ($keys as $key) {
             $subKeyArray = $this->items;

7) /home/evalverde/projects/Price/Src/Domain/ConfigRepository.php:37    [M] Foreach_

--- Original
+++ New
@@ @@
         if (!$this->items || $keys === []) {
             return false;
         }
-        foreach ($keys as $key) {
+        foreach (array() as $key) {
             $subKeyArray = $this->items;
             if ($this->exists($this->items, $key)) {
                 continue;

8) /home/evalverde/projects/Price/Src/Domain/ConfigRepository.php:40    [M] Continue_

--- Original
+++ New
@@ @@
         foreach ($keys as $key) {
             $subKeyArray = $this->items;
             if ($this->exists($this->items, $key)) {
-                continue;
+                break;
             }
             foreach (explode('.', $key) as $segment) {
                 if ($this->accessible($subKeyArray) && $this->exists($subKeyArray, $segment)) {

9) /home/evalverde/projects/Price/Src/Domain/ConfigRepository.php:42    [M] Foreach_

--- Original
+++ New
@@ @@
             if ($this->exists($this->items, $key)) {
                 continue;
             }
-            foreach (explode('.', $key) as $segment) {
+            foreach (array() as $segment) {
                 if ($this->accessible($subKeyArray) && $this->exists($subKeyArray, $segment)) {
                     $subKeyArray = $subKeyArray[$segment];
                 } else {

10) /home/evalverde/projects/Price/Src/Domain/ConfigRepository.php:43    [M] LogicalAnd

--- Original
+++ New
@@ @@
                 continue;
             }
             foreach (explode('.', $key) as $segment) {
-                if ($this->accessible($subKeyArray) && $this->exists($subKeyArray, $segment)) {
+                if ($this->accessible($subKeyArray) || $this->exists($subKeyArray, $segment)) {
                     $subKeyArray = $subKeyArray[$segment];
                 } else {
                     return false;

13) /home/evalverde/projects/Price/Src/Domain/ConfigRepository.php:63    [M] LogicalOr

--- Original
+++ New
@@ @@
      */
     private function accessible($value)
     {
-        return is_array($value) || $value instanceof \ArrayAccess;
+        return is_array($value) && $value instanceof \ArrayAccess;
     }
     /**
      * Determine if the given key exists in the provided array.

14) /home/evalverde/projects/Price/Src/Domain/ConfigRepository.php:80    [M] FunctionCall

--- Original
+++ New
@@ @@
         if ($array instanceof \ArrayAccess) {
             return $array->offsetExists($key);
         }
-        return array_key_exists($key, $array);
+        array_key_exists($key, $array);
+        return null;
     }
     /**
      * Get the specified configuration value.

15) /home/evalverde/projects/Price/Src/Domain/ConfigRepository.php:91    [M] PublicVisibility

--- Original
+++ New
@@ @@
      *
      * @return mixed
      */
-    public function get($key, $default = null)
+    protected function get($key, $default = null)
     {
         if (is_array($key)) {
             return $this->getMany($key);

16) /home/evalverde/projects/Price/Src/Domain/ConfigRepository.php:107    [M] PublicVisibility

--- Original
+++ New
@@ @@
      *
      * @return array
      */
-    public function getMany($keys)
+    protected function getMany($keys)
     {
         $config = [];
         foreach ($keys as $key => $default) {

17) /home/evalverde/projects/Price/Src/Domain/ConfigRepository.php:110    [M] Foreach_

--- Original
+++ New
@@ @@
     public function getMany($keys)
     {
         $config = [];
-        foreach ($keys as $key => $default) {
+        foreach (array() as $key => $default) {
             if (is_numeric($key)) {
                 [$key, $default] = [$default, null];
             }

18) /home/evalverde/projects/Price/Src/Domain/ConfigRepository.php:112    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $config = [];
         foreach ($keys as $key => $default) {
             if (is_numeric($key)) {
-                [$key, $default] = [$default, null];
+                [$default] = [$default, null];
             }
             $config[$key] = $this->arrayGet($this->items, $key, $default);
         }

19) /home/evalverde/projects/Price/Src/Domain/ConfigRepository.php:112    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $config = [];
         foreach ($keys as $key => $default) {
             if (is_numeric($key)) {
-                [$key, $default] = [$default, null];
+                [$key, $default] = [null];
             }
             $config[$key] = $this->arrayGet($this->items, $key, $default);
         }

20) /home/evalverde/projects/Price/Src/Domain/ConfigRepository.php:126    [M] PublicVisibility

--- Original
+++ New
@@ @@
      * @param array|string $key
      * @param mixed        $value
      */
-    public function set($key, $value = null)
+    protected function set($key, $value = null)
     {
         $keys = is_array($key) ? $key : [$key => $value];
         foreach ($keys as $key => $value) {

21) /home/evalverde/projects/Price/Src/Domain/ConfigRepository.php:128    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     public function set($key, $value = null)
     {
-        $keys = is_array($key) ? $key : [$key => $value];
+        $keys = is_array($key) ? $key : [];
         foreach ($keys as $key => $value) {
             $this->arraySet($this->items, $key, $value);
         }

22) /home/evalverde/projects/Price/Src/Domain/ConfigRepository.php:129    [M] Foreach_

--- Original
+++ New
@@ @@
     public function set($key, $value = null)
     {
         $keys = is_array($key) ? $key : [$key => $value];
-        foreach ($keys as $key => $value) {
+        foreach (array() as $key => $value) {
             $this->arraySet($this->items, $key, $value);
         }
     }

23) /home/evalverde/projects/Price/Src/Domain/ConfigRepository.php:130    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $keys = is_array($key) ? $key : [$key => $value];
         foreach ($keys as $key => $value) {
-            $this->arraySet($this->items, $key, $value);
+            
         }
     }
     /**

24) /home/evalverde/projects/Price/Src/Domain/ConfigRepository.php:151    [M] GreaterThanNegotiation

--- Original
+++ New
@@ @@
             return $array = $value;
         }
         $keys = explode('.', $key);
-        while (count($keys) > 1) {
+        while (count($keys) <= 1) {
             $key = array_shift($keys);
             // If the key doesn't exist at this depth, we will just create an empty array
             // to hold the next value, allowing us to create the arrays to hold final

25) /home/evalverde/projects/Price/Src/Domain/ConfigRepository.php:151    [M] GreaterThan

--- Original
+++ New
@@ @@
             return $array = $value;
         }
         $keys = explode('.', $key);
-        while (count($keys) > 1) {
+        while (count($keys) >= 1) {
             $key = array_shift($keys);
             // If the key doesn't exist at this depth, we will just create an empty array
             // to hold the next value, allowing us to create the arrays to hold final

26) /home/evalverde/projects/Price/Src/Domain/ConfigRepository.php:156    [M] LogicalNot

--- Original
+++ New
@@ @@
             // If the key doesn't exist at this depth, we will just create an empty array
             // to hold the next value, allowing us to create the arrays to hold final
             // values at the correct depth. Then we'll keep digging into the array.
-            if (!isset($array[$key]) || !is_array($array[$key])) {
+            if (isset($array[$key]) || !is_array($array[$key])) {
                 $array[$key] = [];
             }
             $array =& $array[$key];

27) /home/evalverde/projects/Price/Src/Domain/ConfigRepository.php:156    [M] LogicalNot

--- Original
+++ New
@@ @@
             // If the key doesn't exist at this depth, we will just create an empty array
             // to hold the next value, allowing us to create the arrays to hold final
             // values at the correct depth. Then we'll keep digging into the array.
-            if (!isset($array[$key]) || !is_array($array[$key])) {
+            if (!isset($array[$key]) || is_array($array[$key])) {
                 $array[$key] = [];
             }
             $array =& $array[$key];

28) /home/evalverde/projects/Price/Src/Domain/ConfigRepository.php:156    [M] LogicalOr

--- Original
+++ New
@@ @@
             // If the key doesn't exist at this depth, we will just create an empty array
             // to hold the next value, allowing us to create the arrays to hold final
             // values at the correct depth. Then we'll keep digging into the array.
-            if (!isset($array[$key]) || !is_array($array[$key])) {
+            if (!isset($array[$key]) && !is_array($array[$key])) {
                 $array[$key] = [];
             }
             $array =& $array[$key];

29) /home/evalverde/projects/Price/Src/Domain/ConfigRepository.php:177    [M] LogicalNot

--- Original
+++ New
@@ @@
      */
     private function arrayGet($array, $key, $default = null)
     {
-        if (!$this->accessible($array)) {
+        if ($this->accessible($array)) {
             return value($default);
         }
         if (is_null($key)) {

30) /home/evalverde/projects/Price/Src/Domain/ConfigRepository.php:178    [M] FunctionCall

--- Original
+++ New
@@ @@
     private function arrayGet($array, $key, $default = null)
     {
         if (!$this->accessible($array)) {
-            return value($default);
+            value($default);
+            return null;
         }
         if (is_null($key)) {
             return $array;

31) /home/evalverde/projects/Price/Src/Domain/ConfigRepository.php:186    [M] FalseValue

--- Original
+++ New
@@ @@
         if ($this->exists($array, $key)) {
             return $array[$key];
         }
-        if (false === strpos($key, '.')) {
+        if (true === strpos($key, '.')) {
             return $array[$key] ?? value($default);
         }
         foreach (explode('.', $key) as $segment) {

32) /home/evalverde/projects/Price/Src/Domain/ConfigRepository.php:186    [M] Identical

--- Original
+++ New
@@ @@
         if ($this->exists($array, $key)) {
             return $array[$key];
         }
-        if (false === strpos($key, '.')) {
+        if (false !== strpos($key, '.')) {
             return $array[$key] ?? value($default);
         }
         foreach (explode('.', $key) as $segment) {

33) /home/evalverde/projects/Price/Src/Domain/ConfigRepository.php:187    [M] Coalesce

--- Original
+++ New
@@ @@
             return $array[$key];
         }
         if (false === strpos($key, '.')) {
-            return $array[$key] ?? value($default);
+            return value($default);
         }
         foreach (explode('.', $key) as $segment) {
             if ($this->accessible($array) && $this->exists($array, $segment)) {

35) /home/evalverde/projects/Price/Src/Domain/ConfigRepository.php:190    [M] LogicalAnd

--- Original
+++ New
@@ @@
             return $array[$key] ?? value($default);
         }
         foreach (explode('.', $key) as $segment) {
-            if ($this->accessible($array) && $this->exists($array, $segment)) {
+            if ($this->accessible($array) || $this->exists($array, $segment)) {
                 $array = $array[$segment];
             } else {
                 return value($default);

36) /home/evalverde/projects/Price/Src/Domain/ConfigRepository.php:193    [M] FunctionCall

--- Original
+++ New
@@ @@
             if ($this->accessible($array) && $this->exists($array, $segment)) {
                 $array = $array[$segment];
             } else {
-                return value($default);
+                value($default);
+                return null;
             }
         }
         return $array;

37) /home/evalverde/projects/Price/Src/Domain/ConfigRepository.php:206    [M] PublicVisibility

--- Original
+++ New
@@ @@
      * @param string $key
      * @param mixed  $value
      */
-    public function prepend($key, $value)
+    protected function prepend($key, $value)
     {
         $array = $this->get($key);
         array_unshift($array, $value);

38) /home/evalverde/projects/Price/Src/Domain/ConfigRepository.php:209    [M] FunctionCallRemoval

--- Original
+++ New
@@ @@
     public function prepend($key, $value)
     {
         $array = $this->get($key);
-        array_unshift($array, $value);
+        
         $this->set($key, $array);
     }
     /**

39) /home/evalverde/projects/Price/Src/Domain/ConfigRepository.php:210    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $array = $this->get($key);
         array_unshift($array, $value);
-        $this->set($key, $array);
+        
     }
     /**
      * Push a value onto an array configuration value.

40) /home/evalverde/projects/Price/Src/Domain/ConfigRepository.php:219    [M] PublicVisibility

--- Original
+++ New
@@ @@
      * @param string $key
      * @param mixed  $value
      */
-    public function push($key, $value)
+    protected function push($key, $value)
     {
         $array = $this->get($key);
         $array[] = $value;

41) /home/evalverde/projects/Price/Src/Domain/ConfigRepository.php:223    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $array = $this->get($key);
         $array[] = $value;
-        $this->set($key, $array);
+        
     }
     /**
      * Get all of the configuration items for the application.

42) /home/evalverde/projects/Price/Src/Domain/ConfigRepository.php:231    [M] PublicVisibility

--- Original
+++ New
@@ @@
      *
      * @return array
      */
-    public function all()
+    protected function all()
     {
         return $this->items;
     }

43) /home/evalverde/projects/Price/Src/Domain/ConfigRepository.php:268    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
      */
     public function offsetSet($key, $value)
     {
-        $this->set($key, $value);
+        
     }
     /**
      * Unset a configuration option.

44) /home/evalverde/projects/Price/Src/Domain/ConfigRepository.php:278    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
      */
     public function offsetUnset($key)
     {
-        $this->set($key, null);
+        
     }
 }

45) /home/evalverde/projects/Price/Src/Domain/Currency.php:11    [M] Identical

--- Original
+++ New
@@ @@
     private $code;
     public function __construct(string $code)
     {
-        if ('' === $code) {
+        if ('' !== $code) {
             throw new \InvalidArgumentException('Currency code should not be empty string');
         }
         $this->code = $code;

46) /home/evalverde/projects/Price/Src/Domain/Currency.php:12    [M] Throw_

--- Original
+++ New
@@ @@
     public function __construct(string $code)
     {
         if ('' === $code) {
-            throw new \InvalidArgumentException('Currency code should not be empty string');
+            new \InvalidArgumentException('Currency code should not be empty string');
         }
         $this->code = $code;
     }

47) /home/evalverde/projects/Price/Src/Domain/Currency.php:18    [M] PublicVisibility

--- Original
+++ New
@@ @@
         }
         $this->code = $code;
     }
-    public function getCode() : string
+    protected function getCode() : string
     {
         return $this->code;
     }

48) /home/evalverde/projects/Price/Src/Domain/Currency.php:23    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->code;
     }
-    public function equals(Currency $other) : bool
+    protected function equals(Currency $other) : bool
     {
         return $this->code === $other->code;
     }

49) /home/evalverde/projects/Price/Src/Domain/Currency.php:25    [M] Identical

--- Original
+++ New
@@ @@
     }
     public function equals(Currency $other) : bool
     {
-        return $this->code === $other->code;
+        return $this->code !== $other->code;
     }
     public function isAvailableWithin(Currencies $currencies) : bool
     {

50) /home/evalverde/projects/Price/Src/Domain/Currency.php:28    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->code === $other->code;
     }
-    public function isAvailableWithin(Currencies $currencies) : bool
+    protected function isAvailableWithin(Currencies $currencies) : bool
     {
         return $currencies->contains($this);
     }

51) /home/evalverde/projects/Price/Src/Domain/Number.php:44    [M] Throw_

--- Original
+++ New
@@ @@
     public static function fromFloat(float $number) : self
     {
         if (false === is_float($number)) {
-            throw new \InvalidArgumentException('Floating point value expected');
+            new \InvalidArgumentException('Floating point value expected');
         }
         return self::fromString(sprintf(self::FLOAT_FORMAT, $number));
     }

52) /home/evalverde/projects/Price/Src/Domain/Number.php:86    [M] PublicVisibility

--- Original
+++ New
@@ @@
         }
         return $this->integerPart . self::NUMERIC_SEPARATOR . $this->fractionalPart;
     }
-    public function isDecimal() : bool
+    protected function isDecimal() : bool
     {
         return self::EMPTY_STRING !== $this->fractionalPart;
     }

53) /home/evalverde/projects/Price/Src/Domain/Number.php:88    [M] NotIdentical

--- Original
+++ New
@@ @@
     }
     public function isDecimal() : bool
     {
-        return self::EMPTY_STRING !== $this->fractionalPart;
+        return self::EMPTY_STRING === $this->fractionalPart;
     }
     public function isInteger() : bool
     {

54) /home/evalverde/projects/Price/Src/Domain/Number.php:91    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return self::EMPTY_STRING !== $this->fractionalPart;
     }
-    public function isInteger() : bool
+    protected function isInteger() : bool
     {
         return self::EMPTY_STRING === $this->fractionalPart;
     }

55) /home/evalverde/projects/Price/Src/Domain/Number.php:93    [M] Identical

--- Original
+++ New
@@ @@
     }
     public function isInteger() : bool
     {
-        return self::EMPTY_STRING === $this->fractionalPart;
+        return self::EMPTY_STRING !== $this->fractionalPart;
     }
     public function isHalf() : bool
     {

56) /home/evalverde/projects/Price/Src/Domain/Number.php:96    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return self::EMPTY_STRING === $this->fractionalPart;
     }
-    public function isHalf() : bool
+    protected function isHalf() : bool
     {
         return '5' === $this->fractionalPart;
     }

57) /home/evalverde/projects/Price/Src/Domain/Number.php:98    [M] Identical

--- Original
+++ New
@@ @@
     }
     public function isHalf() : bool
     {
-        return '5' === $this->fractionalPart;
+        return '5' !== $this->fractionalPart;
     }
     public function isCurrentEven() : bool
     {

58) /home/evalverde/projects/Price/Src/Domain/Number.php:101    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return '5' === $this->fractionalPart;
     }
-    public function isCurrentEven() : bool
+    protected function isCurrentEven() : bool
     {
         $lastIntegerPartNumber = $this->integerPart[strlen($this->integerPart) - 1];
         return 0 === $lastIntegerPartNumber % 2;

59) /home/evalverde/projects/Price/Src/Domain/Number.php:103    [M] OneZeroInteger

--- Original
+++ New
@@ @@
     }
     public function isCurrentEven() : bool
     {
-        $lastIntegerPartNumber = $this->integerPart[strlen($this->integerPart) - 1];
+        $lastIntegerPartNumber = $this->integerPart[strlen($this->integerPart) - 0];
         return 0 === $lastIntegerPartNumber % 2;
     }
     public function isCloserToNext() : bool

60) /home/evalverde/projects/Price/Src/Domain/Number.php:103    [M] Minus

--- Original
+++ New
@@ @@
     }
     public function isCurrentEven() : bool
     {
-        $lastIntegerPartNumber = $this->integerPart[strlen($this->integerPart) - 1];
+        $lastIntegerPartNumber = $this->integerPart[strlen($this->integerPart) + 1];
         return 0 === $lastIntegerPartNumber % 2;
     }
     public function isCloserToNext() : bool

61) /home/evalverde/projects/Price/Src/Domain/Number.php:103    [M] IncrementInteger

--- Original
+++ New
@@ @@
     }
     public function isCurrentEven() : bool
     {
-        $lastIntegerPartNumber = $this->integerPart[strlen($this->integerPart) - 1];
+        $lastIntegerPartNumber = $this->integerPart[strlen($this->integerPart) - 2];
         return 0 === $lastIntegerPartNumber % 2;
     }
     public function isCloserToNext() : bool

62) /home/evalverde/projects/Price/Src/Domain/Number.php:105    [M] Identical

--- Original
+++ New
@@ @@
     public function isCurrentEven() : bool
     {
         $lastIntegerPartNumber = $this->integerPart[strlen($this->integerPart) - 1];
-        return 0 === $lastIntegerPartNumber % 2;
+        return 0 !== $lastIntegerPartNumber % 2;
     }
     public function isCloserToNext() : bool
     {

63) /home/evalverde/projects/Price/Src/Domain/Number.php:105    [M] Modulus

--- Original
+++ New
@@ @@
     public function isCurrentEven() : bool
     {
         $lastIntegerPartNumber = $this->integerPart[strlen($this->integerPart) - 1];
-        return 0 === $lastIntegerPartNumber % 2;
+        return 0 === $lastIntegerPartNumber * 2;
     }
     public function isCloserToNext() : bool
     {

64) /home/evalverde/projects/Price/Src/Domain/Number.php:105    [M] OneZeroInteger

--- Original
+++ New
@@ @@
     public function isCurrentEven() : bool
     {
         $lastIntegerPartNumber = $this->integerPart[strlen($this->integerPart) - 1];
-        return 0 === $lastIntegerPartNumber % 2;
+        return 1 === $lastIntegerPartNumber % 2;
     }
     public function isCloserToNext() : bool
     {

65) /home/evalverde/projects/Price/Src/Domain/Number.php:105    [M] IncrementInteger

--- Original
+++ New
@@ @@
     public function isCurrentEven() : bool
     {
         $lastIntegerPartNumber = $this->integerPart[strlen($this->integerPart) - 1];
-        return 0 === $lastIntegerPartNumber % 2;
+        return 0 === $lastIntegerPartNumber % 3;
     }
     public function isCloserToNext() : bool
     {

66) /home/evalverde/projects/Price/Src/Domain/Number.php:105    [M] DecrementInteger

--- Original
+++ New
@@ @@
     public function isCurrentEven() : bool
     {
         $lastIntegerPartNumber = $this->integerPart[strlen($this->integerPart) - 1];
-        return 0 === $lastIntegerPartNumber % 2;
+        return 0 === $lastIntegerPartNumber % 1;
     }
     public function isCloserToNext() : bool
     {
