67) /home/evalverde/projects/Price/Src/Domain/Number.php:105    [M] DecrementInteger

--- Original
+++ New
@@ @@
     public function isCurrentEven() : bool
     {
         $lastIntegerPartNumber = $this->integerPart[strlen($this->integerPart) - 1];
-        return 0 === $lastIntegerPartNumber % 2;
+        return -1 === $lastIntegerPartNumber % 2;
     }
     public function isCloserToNext() : bool
     {

68) /home/evalverde/projects/Price/Src/Domain/Number.php:108    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $lastIntegerPartNumber = $this->integerPart[strlen($this->integerPart) - 1];
         return 0 === $lastIntegerPartNumber % 2;
     }
-    public function isCloserToNext() : bool
+    protected function isCloserToNext() : bool
     {
         if (self::EMPTY_STRING === $this->fractionalPart) {
             return false;

69) /home/evalverde/projects/Price/Src/Domain/Number.php:110    [M] Identical

--- Original
+++ New
@@ @@
     }
     public function isCloserToNext() : bool
     {
-        if (self::EMPTY_STRING === $this->fractionalPart) {
+        if (self::EMPTY_STRING !== $this->fractionalPart) {
             return false;
         }
         return $this->fractionalPart[0] >= 5;

70) /home/evalverde/projects/Price/Src/Domain/Number.php:111    [M] FalseValue

--- Original
+++ New
@@ @@
     public function isCloserToNext() : bool
     {
         if (self::EMPTY_STRING === $this->fractionalPart) {
-            return false;
+            return true;
         }
         return $this->fractionalPart[0] >= 5;
     }

71) /home/evalverde/projects/Price/Src/Domain/Number.php:114    [M] GreaterThanOrEqualToNegotiation

--- Original
+++ New
@@ @@
         if (self::EMPTY_STRING === $this->fractionalPart) {
             return false;
         }
-        return $this->fractionalPart[0] >= 5;
+        return $this->fractionalPart[0] < 5;
     }
     public function toFloat() : float
     {

72) /home/evalverde/projects/Price/Src/Domain/Number.php:114    [M] DecrementInteger

--- Original
+++ New
@@ @@
         if (self::EMPTY_STRING === $this->fractionalPart) {
             return false;
         }
-        return $this->fractionalPart[0] >= 5;
+        return $this->fractionalPart[-1] >= 5;
     }
     public function toFloat() : float
     {

73) /home/evalverde/projects/Price/Src/Domain/Number.php:114    [M] GreaterThanOrEqualTo

--- Original
+++ New
@@ @@
         if (self::EMPTY_STRING === $this->fractionalPart) {
             return false;
         }
-        return $this->fractionalPart[0] >= 5;
+        return $this->fractionalPart[0] > 5;
     }
     public function toFloat() : float
     {

74) /home/evalverde/projects/Price/Src/Domain/Number.php:114    [M] OneZeroInteger

--- Original
+++ New
@@ @@
         if (self::EMPTY_STRING === $this->fractionalPart) {
             return false;
         }
-        return $this->fractionalPart[0] >= 5;
+        return $this->fractionalPart[1] >= 5;
     }
     public function toFloat() : float
     {

75) /home/evalverde/projects/Price/Src/Domain/Number.php:124    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return (float) (self::EMPTY_STRING !== $this->fractionalPart) ? $this->integerPart . $this->fractionalPart : $this->integerPart;
     }
-    public function isNegative() : bool
+    protected function isNegative() : bool
     {
         return self::NEGATIVE_SIGN === $this->integerPart[0];
     }

76) /home/evalverde/projects/Price/Src/Domain/Number.php:126    [M] Identical

--- Original
+++ New
@@ @@
     }
     public function isNegative() : bool
     {
-        return self::NEGATIVE_SIGN === $this->integerPart[0];
+        return self::NEGATIVE_SIGN !== $this->integerPart[0];
     }
     public function getIntegerPart() : string
     {

77) /home/evalverde/projects/Price/Src/Domain/Number.php:126    [M] OneZeroInteger

--- Original
+++ New
@@ @@
     }
     public function isNegative() : bool
     {
-        return self::NEGATIVE_SIGN === $this->integerPart[0];
+        return self::NEGATIVE_SIGN === $this->integerPart[1];
     }
     public function getIntegerPart() : string
     {

78) /home/evalverde/projects/Price/Src/Domain/Number.php:126    [M] DecrementInteger

--- Original
+++ New
@@ @@
     }
     public function isNegative() : bool
     {
-        return self::NEGATIVE_SIGN === $this->integerPart[0];
+        return self::NEGATIVE_SIGN === $this->integerPart[-1];
     }
     public function getIntegerPart() : string
     {

79) /home/evalverde/projects/Price/Src/Domain/Number.php:158    [M] Throw_

--- Original
+++ New
@@ @@
                 throw new \InvalidArgumentException(sprintf('Invalid integer part %1$s. Invalid digit %2$s found', $number, $digit));
             }
             if (false === $nonZero && '0' === $digit) {
-                throw new \InvalidArgumentException('Leading zeros are not allowed');
+                new \InvalidArgumentException('Leading zeros are not allowed');
             }
             $nonZero = true;
         }

80) /home/evalverde/projects/Price/Src/Domain/NumberFormatDecorator.php:19    [M] PublicVisibility

--- Original
+++ New
@@ @@
      *
      * @return Number
      */
-    public function roundedNumber(float $round = 0.5) : Number
+    protected function roundedNumber(float $round = 0.5) : Number
     {
         $round = (float) $round;
         $number = $this->number->toFloat();

81) /home/evalverde/projects/Price/Src/Domain/NumberFormatDecorator.php:21    [M] CastFloat

--- Original
+++ New
@@ @@
      */
     public function roundedNumber(float $round = 0.5) : Number
     {
-        $round = (float) $round;
+        $round = $round;
         $number = $this->number->toFloat();
         $mod = fmod($number, $round);
         $result = 0.0;

82) /home/evalverde/projects/Price/Src/Domain/NumberFormatDecorator.php:24    [M] OneZeroFloat

--- Original
+++ New
@@ @@
         $round = (float) $round;
         $number = $this->number->toFloat();
         $mod = fmod($number, $round);
-        $result = 0.0;
+        $result = 1.0;
         if (!is_null($mod) && $mod === $result) {
             $result = $number;
         } else {

83) /home/evalverde/projects/Price/Src/Domain/NumberFormatDecorator.php:26    [M] Identical

--- Original
+++ New
@@ @@
         $number = $this->number->toFloat();
         $mod = fmod($number, $round);
         $result = 0.0;
-        if (!is_null($mod) && $mod === $result) {
+        if (!is_null($mod) && $mod !== $result) {
             $result = $number;
         } else {
             $result = $round - $mod + $number;

84) /home/evalverde/projects/Price/Src/Domain/NumberFormatDecorator.php:26    [M] LogicalAnd

--- Original
+++ New
@@ @@
         $number = $this->number->toFloat();
         $mod = fmod($number, $round);
         $result = 0.0;
-        if (!is_null($mod) && $mod === $result) {
+        if (!is_null($mod) || $mod === $result) {
             $result = $number;
         } else {
             $result = $round - $mod + $number;

85) /home/evalverde/projects/Price/Src/Domain/NumberFormatDecorator.php:26    [M] LogicalNot

--- Original
+++ New
@@ @@
         $number = $this->number->toFloat();
         $mod = fmod($number, $round);
         $result = 0.0;
-        if (!is_null($mod) && $mod === $result) {
+        if (is_null($mod) && $mod === $result) {
             $result = $number;
         } else {
             $result = $round - $mod + $number;

86) /home/evalverde/projects/Price/Src/Domain/NumberFormatDecorator.php:29    [M] Minus

--- Original
+++ New
@@ @@
         if (!is_null($mod) && $mod === $result) {
             $result = $number;
         } else {
-            $result = $round - $mod + $number;
+            $result = $round + $mod + $number;
         }
         if (!is_null($round) && !is_null($result) && mb_strlen($result) > mb_strlen($round)) {
             $result = $this->numberFormat($result, strlen($this->number->getFractionalPart()));

87) /home/evalverde/projects/Price/Src/Domain/NumberFormatDecorator.php:29    [M] Plus

--- Original
+++ New
@@ @@
         if (!is_null($mod) && $mod === $result) {
             $result = $number;
         } else {
-            $result = $round - $mod + $number;
+            $result = $round - $mod - $number;
         }
         if (!is_null($round) && !is_null($result) && mb_strlen($result) > mb_strlen($round)) {
             $result = $this->numberFormat($result, strlen($this->number->getFractionalPart()));

88) /home/evalverde/projects/Price/Src/Domain/NumberFormatDecorator.php:32    [M] MBString

--- Original
+++ New
@@ @@
         } else {
             $result = $round - $mod + $number;
         }
-        if (!is_null($round) && !is_null($result) && mb_strlen($result) > mb_strlen($round)) {
+        if (!is_null($round) && !is_null($result) && strlen($result) > mb_strlen($round)) {
             $result = $this->numberFormat($result, strlen($this->number->getFractionalPart()));
         }
         return Number::fromFloat($result);

89) /home/evalverde/projects/Price/Src/Domain/NumberFormatDecorator.php:32    [M] LogicalAnd

--- Original
+++ New
@@ @@
         } else {
             $result = $round - $mod + $number;
         }
-        if (!is_null($round) && !is_null($result) && mb_strlen($result) > mb_strlen($round)) {
+        if ((!is_null($round) || !is_null($result)) && mb_strlen($result) > mb_strlen($round)) {
             $result = $this->numberFormat($result, strlen($this->number->getFractionalPart()));
         }
         return Number::fromFloat($result);

90) /home/evalverde/projects/Price/Src/Domain/NumberFormatDecorator.php:32    [M] LogicalNot

--- Original
+++ New
@@ @@
         } else {
             $result = $round - $mod + $number;
         }
-        if (!is_null($round) && !is_null($result) && mb_strlen($result) > mb_strlen($round)) {
+        if (is_null($round) && !is_null($result) && mb_strlen($result) > mb_strlen($round)) {
             $result = $this->numberFormat($result, strlen($this->number->getFractionalPart()));
         }
         return Number::fromFloat($result);

91) /home/evalverde/projects/Price/Src/Domain/NumberFormatDecorator.php:32    [M] LogicalNot

--- Original
+++ New
@@ @@
         } else {
             $result = $round - $mod + $number;
         }
-        if (!is_null($round) && !is_null($result) && mb_strlen($result) > mb_strlen($round)) {
+        if (!is_null($round) && is_null($result) && mb_strlen($result) > mb_strlen($round)) {
             $result = $this->numberFormat($result, strlen($this->number->getFractionalPart()));
         }
         return Number::fromFloat($result);

92) /home/evalverde/projects/Price/Src/Domain/NumberFormatDecorator.php:32    [M] LogicalAnd

--- Original
+++ New
@@ @@
         } else {
             $result = $round - $mod + $number;
         }
-        if (!is_null($round) && !is_null($result) && mb_strlen($result) > mb_strlen($round)) {
+        if (!is_null($round) && !is_null($result) || mb_strlen($result) > mb_strlen($round)) {
             $result = $this->numberFormat($result, strlen($this->number->getFractionalPart()));
         }
         return Number::fromFloat($result);

93) /home/evalverde/projects/Price/Src/Domain/NumberFormatDecorator.php:32    [M] GreaterThanNegotiation

--- Original
+++ New
@@ @@
         } else {
             $result = $round - $mod + $number;
         }
-        if (!is_null($round) && !is_null($result) && mb_strlen($result) > mb_strlen($round)) {
+        if (!is_null($round) && !is_null($result) && mb_strlen($result) <= mb_strlen($round)) {
             $result = $this->numberFormat($result, strlen($this->number->getFractionalPart()));
         }
         return Number::fromFloat($result);

94) /home/evalverde/projects/Price/Src/Domain/NumberFormatDecorator.php:32    [M] GreaterThan

--- Original
+++ New
@@ @@
         } else {
             $result = $round - $mod + $number;
         }
-        if (!is_null($round) && !is_null($result) && mb_strlen($result) > mb_strlen($round)) {
+        if (!is_null($round) && !is_null($result) && mb_strlen($result) >= mb_strlen($round)) {
             $result = $this->numberFormat($result, strlen($this->number->getFractionalPart()));
         }
         return Number::fromFloat($result);

95) /home/evalverde/projects/Price/Src/Domain/NumberFormatDecorator.php:32    [M] MBString

--- Original
+++ New
@@ @@
         } else {
             $result = $round - $mod + $number;
         }
-        if (!is_null($round) && !is_null($result) && mb_strlen($result) > mb_strlen($round)) {
+        if (!is_null($round) && !is_null($result) && mb_strlen($result) > strlen($round)) {
             $result = $this->numberFormat($result, strlen($this->number->getFractionalPart()));
         }
         return Number::fromFloat($result);

96) /home/evalverde/projects/Price/Src/Domain/NumberFormatDecorator.php:39    [M] IncrementInteger

--- Original
+++ New
@@ @@
         }
         return Number::fromFloat($result);
     }
-    private function numberFormat(float $psp, $precision = 2) : float
+    private function numberFormat(float $psp, $precision = 3) : float
     {
         return (float) number_format($psp, $precision, '.', '');
     }

97) /home/evalverde/projects/Price/Src/Domain/NumberFormatDecorator.php:39    [M] DecrementInteger

--- Original
+++ New
@@ @@
         }
         return Number::fromFloat($result);
     }
-    private function numberFormat(float $psp, $precision = 2) : float
+    private function numberFormat(float $psp, $precision = 1) : float
     {
         return (float) number_format($psp, $precision, '.', '');
     }

98) /home/evalverde/projects/Price/Src/Domain/NumberFormatDecorator.php:41    [M] CastFloat

--- Original
+++ New
@@ @@
     }
     private function numberFormat(float $psp, $precision = 2) : float
     {
-        return (float) number_format($psp, $precision, '.', '');
+        return number_format($psp, $precision, '.', '');
     }
     private function numberFormatRounded(float $psp, $round = false, $precision = 2) : float
     {

99) /home/evalverde/projects/Price/Src/Domain/NumberFormatDecorator.php:44    [M] IncrementInteger

--- Original
+++ New
@@ @@
     {
         return (float) number_format($psp, $precision, '.', '');
     }
-    private function numberFormatRounded(float $psp, $round = false, $precision = 2) : float
+    private function numberFormatRounded(float $psp, $round = false, $precision = 3) : float
     {
         return intval($psp * ($p = pow(10, $precision))) / $p;
     }
 }

100) /home/evalverde/projects/Price/Src/Domain/NumberFormatDecorator.php:44    [M] FalseValue

--- Original
+++ New
@@ @@
     {
         return (float) number_format($psp, $precision, '.', '');
     }
-    private function numberFormatRounded(float $psp, $round = false, $precision = 2) : float
+    private function numberFormatRounded(float $psp, $round = true, $precision = 2) : float
     {
         return intval($psp * ($p = pow(10, $precision))) / $p;
     }
 }

101) /home/evalverde/projects/Price/Src/Domain/NumberFormatDecorator.php:44    [M] DecrementInteger

--- Original
+++ New
@@ @@
     {
         return (float) number_format($psp, $precision, '.', '');
     }
-    private function numberFormatRounded(float $psp, $round = false, $precision = 2) : float
+    private function numberFormatRounded(float $psp, $round = false, $precision = 1) : float
     {
         return intval($psp * ($p = pow(10, $precision))) / $p;
     }
 }

102) /home/evalverde/projects/Price/Src/Domain/NumberFormatDecorator.php:46    [M] Division

--- Original
+++ New
@@ @@
     }
     private function numberFormatRounded(float $psp, $round = false, $precision = 2) : float
     {
-        return intval($psp * ($p = pow(10, $precision))) / $p;
+        return intval($psp * ($p = pow(10, $precision))) * $p;
     }
 }

103) /home/evalverde/projects/Price/Src/Domain/NumberFormatDecorator.php:46    [M] IncrementInteger

--- Original
+++ New
@@ @@
     }
     private function numberFormatRounded(float $psp, $round = false, $precision = 2) : float
     {
-        return intval($psp * ($p = pow(10, $precision))) / $p;
+        return intval($psp * ($p = pow(11, $precision))) / $p;
     }
 }

104) /home/evalverde/projects/Price/Src/Domain/NumberFormatDecorator.php:46    [M] DecrementInteger

--- Original
+++ New
@@ @@
     }
     private function numberFormatRounded(float $psp, $round = false, $precision = 2) : float
     {
-        return intval($psp * ($p = pow(10, $precision))) / $p;
+        return intval($psp * ($p = pow(9, $precision))) / $p;
     }
 }

105) /home/evalverde/projects/Price/Src/Domain/NumberFormatDecorator.php:46    [M] Multiplication

--- Original
+++ New
@@ @@
     }
     private function numberFormatRounded(float $psp, $round = false, $precision = 2) : float
     {
-        return intval($psp * ($p = pow(10, $precision))) / $p;
+        return intval($psp / ($p = pow(10, $precision))) / $p;
     }
 }

106) /home/evalverde/projects/Price/Src/Domain/NumericPrice.php:18    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->integer = $integer;
         $this->decimal = $decimal;
     }
-    public function getFloatingPrice() : float
+    protected function getFloatingPrice() : float
     {
         return (float) ($this->integer . '.' . $this->decimal);
     }

107) /home/evalverde/projects/Price/Src/Domain/NumericPrice.php:20    [M] CastFloat

--- Original
+++ New
@@ @@
     }
     public function getFloatingPrice() : float
     {
-        return (float) ($this->integer . '.' . $this->decimal);
+        return $this->integer . '.' . $this->decimal;
     }
     public function __toString()
     {

108) /home/evalverde/projects/Price/Src/Domain/NumericPrice.php:25    [M] CastString

--- Original
+++ New
@@ @@
     }
     public function __toString()
     {
-        return (string) $this->integer . '.' . $this->decimal;
+        return $this->integer . '.' . $this->decimal;
     }
     public static function createPrice(int $integer, int $decimal) : self
     {

109) /home/evalverde/projects/Price/Src/Domain/NumericPrice.php:28    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return (string) $this->integer . '.' . $this->decimal;
     }
-    public static function createPrice(int $integer, int $decimal) : self
+    protected static function createPrice(int $integer, int $decimal) : self
     {
         return new static($integer, $decimal);
     }
 }

110) /home/evalverde/projects/Price/Src/Domain/Rounder.php:16    [M] PublicVisibility

--- Original
+++ New
@@ @@
      *
      * @return string
      */
-    public static function roundMoneyValue(string $moneyValue, int $targetDigits, int $havingDigits)
+    protected static function roundMoneyValue(string $moneyValue, int $targetDigits, int $havingDigits)
     {
         $valueLength = strlen($moneyValue);
         $shouldRound = $targetDigits < $havingDigits && $valueLength - $havingDigits + $targetDigits > 0;

111) /home/evalverde/projects/Price/Src/Domain/Rounder.php:19    [M] Minus

--- Original
+++ New
@@ @@
     public static function roundMoneyValue(string $moneyValue, int $targetDigits, int $havingDigits)
     {
         $valueLength = strlen($moneyValue);
-        $shouldRound = $targetDigits < $havingDigits && $valueLength - $havingDigits + $targetDigits > 0;
+        $shouldRound = $targetDigits < $havingDigits && $valueLength + $havingDigits + $targetDigits > 0;
         if ($shouldRound && $moneyValue[$valueLength - $havingDigits + $targetDigits] >= 5) {
             $position = $valueLength - $havingDigits + $targetDigits;
             $addend = 1;

112) /home/evalverde/projects/Price/Src/Domain/Rounder.php:19    [M] Plus

--- Original
+++ New
@@ @@
     public static function roundMoneyValue(string $moneyValue, int $targetDigits, int $havingDigits)
     {
         $valueLength = strlen($moneyValue);
-        $shouldRound = $targetDigits < $havingDigits && $valueLength - $havingDigits + $targetDigits > 0;
+        $shouldRound = $targetDigits < $havingDigits && $valueLength - $havingDigits - $targetDigits > 0;
         if ($shouldRound && $moneyValue[$valueLength - $havingDigits + $targetDigits] >= 5) {
             $position = $valueLength - $havingDigits + $targetDigits;
             $addend = 1;

113) /home/evalverde/projects/Price/Src/Domain/Rounder.php:19    [M] GreaterThan

--- Original
+++ New
@@ @@
     public static function roundMoneyValue(string $moneyValue, int $targetDigits, int $havingDigits)
     {
         $valueLength = strlen($moneyValue);
-        $shouldRound = $targetDigits < $havingDigits && $valueLength - $havingDigits + $targetDigits > 0;
+        $shouldRound = $targetDigits < $havingDigits && $valueLength - $havingDigits + $targetDigits >= 0;
         if ($shouldRound && $moneyValue[$valueLength - $havingDigits + $targetDigits] >= 5) {
             $position = $valueLength - $havingDigits + $targetDigits;
             $addend = 1;

114) /home/evalverde/projects/Price/Src/Domain/Rounder.php:19    [M] GreaterThanNegotiation

--- Original
+++ New
@@ @@
     public static function roundMoneyValue(string $moneyValue, int $targetDigits, int $havingDigits)
     {
         $valueLength = strlen($moneyValue);
-        $shouldRound = $targetDigits < $havingDigits && $valueLength - $havingDigits + $targetDigits > 0;
+        $shouldRound = $targetDigits < $havingDigits && $valueLength - $havingDigits + $targetDigits <= 0;
         if ($shouldRound && $moneyValue[$valueLength - $havingDigits + $targetDigits] >= 5) {
             $position = $valueLength - $havingDigits + $targetDigits;
             $addend = 1;

115) /home/evalverde/projects/Price/Src/Domain/Rounder.php:19    [M] LogicalAnd

--- Original
+++ New
@@ @@
     public static function roundMoneyValue(string $moneyValue, int $targetDigits, int $havingDigits)
     {
         $valueLength = strlen($moneyValue);
-        $shouldRound = $targetDigits < $havingDigits && $valueLength - $havingDigits + $targetDigits > 0;
+        $shouldRound = $targetDigits < $havingDigits || $valueLength - $havingDigits + $targetDigits > 0;
         if ($shouldRound && $moneyValue[$valueLength - $havingDigits + $targetDigits] >= 5) {
             $position = $valueLength - $havingDigits + $targetDigits;
             $addend = 1;

116) /home/evalverde/projects/Price/Src/Domain/Rounder.php:19    [M] LessThanNegotiation

--- Original
+++ New
@@ @@
     public static function roundMoneyValue(string $moneyValue, int $targetDigits, int $havingDigits)
     {
         $valueLength = strlen($moneyValue);
-        $shouldRound = $targetDigits < $havingDigits && $valueLength - $havingDigits + $targetDigits > 0;
+        $shouldRound = $targetDigits >= $havingDigits && $valueLength - $havingDigits + $targetDigits > 0;
         if ($shouldRound && $moneyValue[$valueLength - $havingDigits + $targetDigits] >= 5) {
             $position = $valueLength - $havingDigits + $targetDigits;
             $addend = 1;

117) /home/evalverde/projects/Price/Src/Domain/Rounder.php:19    [M] LessThan

--- Original
+++ New
@@ @@
     public static function roundMoneyValue(string $moneyValue, int $targetDigits, int $havingDigits)
     {
         $valueLength = strlen($moneyValue);
-        $shouldRound = $targetDigits < $havingDigits && $valueLength - $havingDigits + $targetDigits > 0;
+        $shouldRound = $targetDigits <= $havingDigits && $valueLength - $havingDigits + $targetDigits > 0;
         if ($shouldRound && $moneyValue[$valueLength - $havingDigits + $targetDigits] >= 5) {
             $position = $valueLength - $havingDigits + $targetDigits;
             $addend = 1;

118) /home/evalverde/projects/Price/Src/Domain/Rounder.php:21    [M] Minus

--- Original
+++ New
@@ @@
     {
         $valueLength = strlen($moneyValue);
         $shouldRound = $targetDigits < $havingDigits && $valueLength - $havingDigits + $targetDigits > 0;
-        if ($shouldRound && $moneyValue[$valueLength - $havingDigits + $targetDigits] >= 5) {
+        if ($shouldRound && $moneyValue[$valueLength + $havingDigits + $targetDigits] >= 5) {
             $position = $valueLength - $havingDigits + $targetDigits;
             $addend = 1;
             while ($position > 0) {

119) /home/evalverde/projects/Price/Src/Domain/Rounder.php:21    [M] Plus

--- Original
+++ New
@@ @@
     {
         $valueLength = strlen($moneyValue);
         $shouldRound = $targetDigits < $havingDigits && $valueLength - $havingDigits + $targetDigits > 0;
-        if ($shouldRound && $moneyValue[$valueLength - $havingDigits + $targetDigits] >= 5) {
+        if ($shouldRound && $moneyValue[$valueLength - $havingDigits - $targetDigits] >= 5) {
             $position = $valueLength - $havingDigits + $targetDigits;
             $addend = 1;
             while ($position > 0) {

120) /home/evalverde/projects/Price/Src/Domain/Rounder.php:21    [M] GreaterThanOrEqualTo

--- Original
+++ New
@@ @@
     {
         $valueLength = strlen($moneyValue);
         $shouldRound = $targetDigits < $havingDigits && $valueLength - $havingDigits + $targetDigits > 0;
-        if ($shouldRound && $moneyValue[$valueLength - $havingDigits + $targetDigits] >= 5) {
+        if ($shouldRound && $moneyValue[$valueLength - $havingDigits + $targetDigits] > 5) {
             $position = $valueLength - $havingDigits + $targetDigits;
             $addend = 1;
             while ($position > 0) {

121) /home/evalverde/projects/Price/Src/Domain/Rounder.php:21    [M] GreaterThanOrEqualToNegotiation

--- Original
+++ New
@@ @@
     {
         $valueLength = strlen($moneyValue);
         $shouldRound = $targetDigits < $havingDigits && $valueLength - $havingDigits + $targetDigits > 0;
-        if ($shouldRound && $moneyValue[$valueLength - $havingDigits + $targetDigits] >= 5) {
+        if ($shouldRound && $moneyValue[$valueLength - $havingDigits + $targetDigits] < 5) {
             $position = $valueLength - $havingDigits + $targetDigits;
             $addend = 1;
             while ($position > 0) {

122) /home/evalverde/projects/Price/Src/Domain/Rounder.php:21    [M] LogicalAnd

--- Original
+++ New
@@ @@
     {
         $valueLength = strlen($moneyValue);
         $shouldRound = $targetDigits < $havingDigits && $valueLength - $havingDigits + $targetDigits > 0;
-        if ($shouldRound && $moneyValue[$valueLength - $havingDigits + $targetDigits] >= 5) {
+        if ($shouldRound || $moneyValue[$valueLength - $havingDigits + $targetDigits] >= 5) {
             $position = $valueLength - $havingDigits + $targetDigits;
             $addend = 1;
             while ($position > 0) {

123) /home/evalverde/projects/Price/Src/Domain/Rounder.php:22    [M] Minus

--- Original
+++ New
@@ @@
         $valueLength = strlen($moneyValue);
         $shouldRound = $targetDigits < $havingDigits && $valueLength - $havingDigits + $targetDigits > 0;
         if ($shouldRound && $moneyValue[$valueLength - $havingDigits + $targetDigits] >= 5) {
-            $position = $valueLength - $havingDigits + $targetDigits;
+            $position = $valueLength + $havingDigits + $targetDigits;
             $addend = 1;
             while ($position > 0) {
                 $newValue = (string) ((int) $moneyValue[$position - 1] + $addend);

124) /home/evalverde/projects/Price/Src/Domain/Rounder.php:22    [M] Plus

--- Original
+++ New
@@ @@
         $valueLength = strlen($moneyValue);
         $shouldRound = $targetDigits < $havingDigits && $valueLength - $havingDigits + $targetDigits > 0;
         if ($shouldRound && $moneyValue[$valueLength - $havingDigits + $targetDigits] >= 5) {
-            $position = $valueLength - $havingDigits + $targetDigits;
+            $position = $valueLength - $havingDigits - $targetDigits;
             $addend = 1;
             while ($position > 0) {
                 $newValue = (string) ((int) $moneyValue[$position - 1] + $addend);

125) /home/evalverde/projects/Price/Src/Domain/Rounder.php:23    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $shouldRound = $targetDigits < $havingDigits && $valueLength - $havingDigits + $targetDigits > 0;
         if ($shouldRound && $moneyValue[$valueLength - $havingDigits + $targetDigits] >= 5) {
             $position = $valueLength - $havingDigits + $targetDigits;
-            $addend = 1;
+            $addend = 2;
             while ($position > 0) {
                 $newValue = (string) ((int) $moneyValue[$position - 1] + $addend);
                 if ($newValue >= 10) {

126) /home/evalverde/projects/Price/Src/Domain/Rounder.php:23    [M] OneZeroInteger

--- Original
+++ New
@@ @@
         $shouldRound = $targetDigits < $havingDigits && $valueLength - $havingDigits + $targetDigits > 0;
         if ($shouldRound && $moneyValue[$valueLength - $havingDigits + $targetDigits] >= 5) {
             $position = $valueLength - $havingDigits + $targetDigits;
-            $addend = 1;
+            $addend = 0;
             while ($position > 0) {
                 $newValue = (string) ((int) $moneyValue[$position - 1] + $addend);
                 if ($newValue >= 10) {

127) /home/evalverde/projects/Price/Src/Domain/Rounder.php:25    [M] GreaterThan

--- Original
+++ New
@@ @@
         if ($shouldRound && $moneyValue[$valueLength - $havingDigits + $targetDigits] >= 5) {
             $position = $valueLength - $havingDigits + $targetDigits;
             $addend = 1;
-            while ($position > 0) {
+            while ($position >= 0) {
                 $newValue = (string) ((int) $moneyValue[$position - 1] + $addend);
                 if ($newValue >= 10) {
                     $moneyValue[$position - 1] = $newValue[1];
