128) /home/evalverde/projects/Price/Src/Domain/Rounder.php:25    [M] GreaterThanNegotiation

--- Original
+++ New
@@ @@
         if ($shouldRound && $moneyValue[$valueLength - $havingDigits + $targetDigits] >= 5) {
             $position = $valueLength - $havingDigits + $targetDigits;
             $addend = 1;
-            while ($position > 0) {
+            while ($position <= 0) {
                 $newValue = (string) ((int) $moneyValue[$position - 1] + $addend);
                 if ($newValue >= 10) {
                     $moneyValue[$position - 1] = $newValue[1];

129) /home/evalverde/projects/Price/Src/Domain/Rounder.php:26    [M] IncrementInteger

--- Original
+++ New
@@ @@
             $position = $valueLength - $havingDigits + $targetDigits;
             $addend = 1;
             while ($position > 0) {
-                $newValue = (string) ((int) $moneyValue[$position - 1] + $addend);
+                $newValue = (string) ((int) $moneyValue[$position - 2] + $addend);
                 if ($newValue >= 10) {
                     $moneyValue[$position - 1] = $newValue[1];
                     $addend = $newValue[0];

130) /home/evalverde/projects/Price/Src/Domain/Rounder.php:26    [M] OneZeroInteger

--- Original
+++ New
@@ @@
             $position = $valueLength - $havingDigits + $targetDigits;
             $addend = 1;
             while ($position > 0) {
-                $newValue = (string) ((int) $moneyValue[$position - 1] + $addend);
+                $newValue = (string) ((int) $moneyValue[$position - 0] + $addend);
                 if ($newValue >= 10) {
                     $moneyValue[$position - 1] = $newValue[1];
                     $addend = $newValue[0];

131) /home/evalverde/projects/Price/Src/Domain/Rounder.php:26    [M] Minus

--- Original
+++ New
@@ @@
             $position = $valueLength - $havingDigits + $targetDigits;
             $addend = 1;
             while ($position > 0) {
-                $newValue = (string) ((int) $moneyValue[$position - 1] + $addend);
+                $newValue = (string) ((int) $moneyValue[$position + 1] + $addend);
                 if ($newValue >= 10) {
                     $moneyValue[$position - 1] = $newValue[1];
                     $addend = $newValue[0];

132) /home/evalverde/projects/Price/Src/Domain/Rounder.php:26    [M] CastInt

--- Original
+++ New
@@ @@
             $position = $valueLength - $havingDigits + $targetDigits;
             $addend = 1;
             while ($position > 0) {
-                $newValue = (string) ((int) $moneyValue[$position - 1] + $addend);
+                $newValue = (string) ($moneyValue[$position - 1] + $addend);
                 if ($newValue >= 10) {
                     $moneyValue[$position - 1] = $newValue[1];
                     $addend = $newValue[0];

133) /home/evalverde/projects/Price/Src/Domain/Rounder.php:26    [M] CastString

--- Original
+++ New
@@ @@
             $position = $valueLength - $havingDigits + $targetDigits;
             $addend = 1;
             while ($position > 0) {
-                $newValue = (string) ((int) $moneyValue[$position - 1] + $addend);
+                $newValue = (int) $moneyValue[$position - 1] + $addend;
                 if ($newValue >= 10) {
                     $moneyValue[$position - 1] = $newValue[1];
                     $addend = $newValue[0];

134) /home/evalverde/projects/Price/Src/Domain/Rounder.php:26    [M] Plus

--- Original
+++ New
@@ @@
             $position = $valueLength - $havingDigits + $targetDigits;
             $addend = 1;
             while ($position > 0) {
-                $newValue = (string) ((int) $moneyValue[$position - 1] + $addend);
+                $newValue = (string) ((int) $moneyValue[$position - 1] - $addend);
                 if ($newValue >= 10) {
                     $moneyValue[$position - 1] = $newValue[1];
                     $addend = $newValue[0];

135) /home/evalverde/projects/Price/Src/Domain/Rounder.php:28    [M] GreaterThanOrEqualToNegotiation

--- Original
+++ New
@@ @@
             $addend = 1;
             while ($position > 0) {
                 $newValue = (string) ((int) $moneyValue[$position - 1] + $addend);
-                if ($newValue >= 10) {
+                if ($newValue < 10) {
                     $moneyValue[$position - 1] = $newValue[1];
                     $addend = $newValue[0];
                     --$position;

136) /home/evalverde/projects/Price/Src/Domain/Rounder.php:28    [M] GreaterThanOrEqualTo

--- Original
+++ New
@@ @@
             $addend = 1;
             while ($position > 0) {
                 $newValue = (string) ((int) $moneyValue[$position - 1] + $addend);
-                if ($newValue >= 10) {
+                if ($newValue > 10) {
                     $moneyValue[$position - 1] = $newValue[1];
                     $addend = $newValue[0];
                     --$position;

137) /home/evalverde/projects/Price/Src/Domain/Rounder.php:29    [M] IncrementInteger

--- Original
+++ New
@@ @@
             while ($position > 0) {
                 $newValue = (string) ((int) $moneyValue[$position - 1] + $addend);
                 if ($newValue >= 10) {
-                    $moneyValue[$position - 1] = $newValue[1];
+                    $moneyValue[$position - 2] = $newValue[1];
                     $addend = $newValue[0];
                     --$position;
                     if (0 === $position) {

138) /home/evalverde/projects/Price/Src/Domain/Rounder.php:29    [M] OneZeroInteger

--- Original
+++ New
@@ @@
             while ($position > 0) {
                 $newValue = (string) ((int) $moneyValue[$position - 1] + $addend);
                 if ($newValue >= 10) {
-                    $moneyValue[$position - 1] = $newValue[1];
+                    $moneyValue[$position - 0] = $newValue[1];
                     $addend = $newValue[0];
                     --$position;
                     if (0 === $position) {

139) /home/evalverde/projects/Price/Src/Domain/Rounder.php:29    [M] Minus

--- Original
+++ New
@@ @@
             while ($position > 0) {
                 $newValue = (string) ((int) $moneyValue[$position - 1] + $addend);
                 if ($newValue >= 10) {
-                    $moneyValue[$position - 1] = $newValue[1];
+                    $moneyValue[$position + 1] = $newValue[1];
                     $addend = $newValue[0];
                     --$position;
                     if (0 === $position) {

140) /home/evalverde/projects/Price/Src/Domain/Rounder.php:29    [M] IncrementInteger

--- Original
+++ New
@@ @@
             while ($position > 0) {
                 $newValue = (string) ((int) $moneyValue[$position - 1] + $addend);
                 if ($newValue >= 10) {
-                    $moneyValue[$position - 1] = $newValue[1];
+                    $moneyValue[$position - 1] = $newValue[2];
                     $addend = $newValue[0];
                     --$position;
                     if (0 === $position) {

141) /home/evalverde/projects/Price/Src/Domain/Rounder.php:29    [M] OneZeroInteger

--- Original
+++ New
@@ @@
             while ($position > 0) {
                 $newValue = (string) ((int) $moneyValue[$position - 1] + $addend);
                 if ($newValue >= 10) {
-                    $moneyValue[$position - 1] = $newValue[1];
+                    $moneyValue[$position - 1] = $newValue[0];
                     $addend = $newValue[0];
                     --$position;
                     if (0 === $position) {

142) /home/evalverde/projects/Price/Src/Domain/Rounder.php:30    [M] DecrementInteger

--- Original
+++ New
@@ @@
                 $newValue = (string) ((int) $moneyValue[$position - 1] + $addend);
                 if ($newValue >= 10) {
                     $moneyValue[$position - 1] = $newValue[1];
-                    $addend = $newValue[0];
+                    $addend = $newValue[-1];
                     --$position;
                     if (0 === $position) {
                         $moneyValue = $addend . $moneyValue;

143) /home/evalverde/projects/Price/Src/Domain/Rounder.php:30    [M] OneZeroInteger

--- Original
+++ New
@@ @@
                 $newValue = (string) ((int) $moneyValue[$position - 1] + $addend);
                 if ($newValue >= 10) {
                     $moneyValue[$position - 1] = $newValue[1];
-                    $addend = $newValue[0];
+                    $addend = $newValue[1];
                     --$position;
                     if (0 === $position) {
                         $moneyValue = $addend . $moneyValue;

144) /home/evalverde/projects/Price/Src/Domain/Rounder.php:31    [M] Decrement

--- Original
+++ New
@@ @@
                 if ($newValue >= 10) {
                     $moneyValue[$position - 1] = $newValue[1];
                     $addend = $newValue[0];
-                    --$position;
+                    ++$position;
                     if (0 === $position) {
                         $moneyValue = $addend . $moneyValue;
                     }

145) /home/evalverde/projects/Price/Src/Domain/Rounder.php:32    [M] DecrementInteger

--- Original
+++ New
@@ @@
                     $moneyValue[$position - 1] = $newValue[1];
                     $addend = $newValue[0];
                     --$position;
-                    if (0 === $position) {
+                    if (-1 === $position) {
                         $moneyValue = $addend . $moneyValue;
                     }
                 } else {

146) /home/evalverde/projects/Price/Src/Domain/Rounder.php:32    [M] OneZeroInteger

--- Original
+++ New
@@ @@
                     $moneyValue[$position - 1] = $newValue[1];
                     $addend = $newValue[0];
                     --$position;
-                    if (0 === $position) {
+                    if (1 === $position) {
                         $moneyValue = $addend . $moneyValue;
                     }
                 } else {

147) /home/evalverde/projects/Price/Src/Domain/Rounder.php:32    [M] Identical

--- Original
+++ New
@@ @@
                     $moneyValue[$position - 1] = $newValue[1];
                     $addend = $newValue[0];
                     --$position;
-                    if (0 === $position) {
+                    if (0 !== $position) {
                         $moneyValue = $addend . $moneyValue;
                     }
                 } else {

148) /home/evalverde/projects/Price/Src/Domain/Rounder.php:36    [M] Identical

--- Original
+++ New
@@ @@
                         $moneyValue = $addend . $moneyValue;
                     }
                 } else {
-                    if ('-' === $moneyValue[$position - 1]) {
+                    if ('-' !== $moneyValue[$position - 1]) {
                         $moneyValue[$position - 1] = $newValue[0];
                         $moneyValue = '-' . $moneyValue;
                     } else {

149) /home/evalverde/projects/Price/Src/Domain/Rounder.php:36    [M] Minus

--- Original
+++ New
@@ @@
                         $moneyValue = $addend . $moneyValue;
                     }
                 } else {
-                    if ('-' === $moneyValue[$position - 1]) {
+                    if ('-' === $moneyValue[$position + 1]) {
                         $moneyValue[$position - 1] = $newValue[0];
                         $moneyValue = '-' . $moneyValue;
                     } else {

150) /home/evalverde/projects/Price/Src/Domain/Rounder.php:36    [M] IncrementInteger

--- Original
+++ New
@@ @@
                         $moneyValue = $addend . $moneyValue;
                     }
                 } else {
-                    if ('-' === $moneyValue[$position - 1]) {
+                    if ('-' === $moneyValue[$position - 2]) {
                         $moneyValue[$position - 1] = $newValue[0];
                         $moneyValue = '-' . $moneyValue;
                     } else {

151) /home/evalverde/projects/Price/Src/Domain/Rounder.php:36    [M] OneZeroInteger

--- Original
+++ New
@@ @@
                         $moneyValue = $addend . $moneyValue;
                     }
                 } else {
-                    if ('-' === $moneyValue[$position - 1]) {
+                    if ('-' === $moneyValue[$position - 0]) {
                         $moneyValue[$position - 1] = $newValue[0];
                         $moneyValue = '-' . $moneyValue;
                     } else {

152) /home/evalverde/projects/Price/Src/Domain/Rounder.php:37    [M] OneZeroInteger

--- Original
+++ New
@@ @@
                     }
                 } else {
                     if ('-' === $moneyValue[$position - 1]) {
-                        $moneyValue[$position - 1] = $newValue[0];
+                        $moneyValue[$position - 1] = $newValue[1];
                         $moneyValue = '-' . $moneyValue;
                     } else {
                         $moneyValue[$position - 1] = $newValue[0];

153) /home/evalverde/projects/Price/Src/Domain/Rounder.php:37    [M] DecrementInteger

--- Original
+++ New
@@ @@
                     }
                 } else {
                     if ('-' === $moneyValue[$position - 1]) {
-                        $moneyValue[$position - 1] = $newValue[0];
+                        $moneyValue[$position - 1] = $newValue[-1];
                         $moneyValue = '-' . $moneyValue;
                     } else {
                         $moneyValue[$position - 1] = $newValue[0];

154) /home/evalverde/projects/Price/Src/Domain/Rounder.php:37    [M] Minus

--- Original
+++ New
@@ @@
                     }
                 } else {
                     if ('-' === $moneyValue[$position - 1]) {
-                        $moneyValue[$position - 1] = $newValue[0];
+                        $moneyValue[$position + 1] = $newValue[0];
                         $moneyValue = '-' . $moneyValue;
                     } else {
                         $moneyValue[$position - 1] = $newValue[0];

155) /home/evalverde/projects/Price/Src/Domain/Rounder.php:37    [M] OneZeroInteger

--- Original
+++ New
@@ @@
                     }
                 } else {
                     if ('-' === $moneyValue[$position - 1]) {
-                        $moneyValue[$position - 1] = $newValue[0];
+                        $moneyValue[$position - 0] = $newValue[0];
                         $moneyValue = '-' . $moneyValue;
                     } else {
                         $moneyValue[$position - 1] = $newValue[0];

156) /home/evalverde/projects/Price/Src/Domain/Rounder.php:37    [M] IncrementInteger

--- Original
+++ New
@@ @@
                     }
                 } else {
                     if ('-' === $moneyValue[$position - 1]) {
-                        $moneyValue[$position - 1] = $newValue[0];
+                        $moneyValue[$position - 2] = $newValue[0];
                         $moneyValue = '-' . $moneyValue;
                     } else {
                         $moneyValue[$position - 1] = $newValue[0];

157) /home/evalverde/projects/Price/Src/Domain/Rounder.php:40    [M] OneZeroInteger

--- Original
+++ New
@@ @@
                         $moneyValue[$position - 1] = $newValue[0];
                         $moneyValue = '-' . $moneyValue;
                     } else {
-                        $moneyValue[$position - 1] = $newValue[0];
+                        $moneyValue[$position - 0] = $newValue[0];
                     }
                     break;
                 }

158) /home/evalverde/projects/Price/Src/Domain/Rounder.php:40    [M] Minus

--- Original
+++ New
@@ @@
                         $moneyValue[$position - 1] = $newValue[0];
                         $moneyValue = '-' . $moneyValue;
                     } else {
-                        $moneyValue[$position - 1] = $newValue[0];
+                        $moneyValue[$position + 1] = $newValue[0];
                     }
                     break;
                 }

159) /home/evalverde/projects/Price/Src/Domain/Rounder.php:40    [M] DecrementInteger

--- Original
+++ New
@@ @@
                         $moneyValue[$position - 1] = $newValue[0];
                         $moneyValue = '-' . $moneyValue;
                     } else {
-                        $moneyValue[$position - 1] = $newValue[0];
+                        $moneyValue[$position - 1] = $newValue[-1];
                     }
                     break;
                 }

160) /home/evalverde/projects/Price/Src/Domain/Rounder.php:40    [M] OneZeroInteger

--- Original
+++ New
@@ @@
                         $moneyValue[$position - 1] = $newValue[0];
                         $moneyValue = '-' . $moneyValue;
                     } else {
-                        $moneyValue[$position - 1] = $newValue[0];
+                        $moneyValue[$position - 1] = $newValue[1];
                     }
                     break;
                 }

161) /home/evalverde/projects/Price/Src/Domain/Rounder.php:40    [M] IncrementInteger

--- Original
+++ New
@@ @@
                         $moneyValue[$position - 1] = $newValue[0];
                         $moneyValue = '-' . $moneyValue;
                     } else {
-                        $moneyValue[$position - 1] = $newValue[0];
+                        $moneyValue[$position - 2] = $newValue[0];
                     }
                     break;
                 }

163) /home/evalverde/projects/Price/Src/Domain/StringPrice.php:15    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     private $price;
     private function __construct(string $price)
     {
-        $this->setPrice($price);
+        
     }
     private function setPrice(string $price) : void
     {
